doc/html/index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Getting Started with Nitrogen</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Getting Started with Nitrogen"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-11-12 19:50:35 CST"/>
<meta name="author" content="Rusty Klophaus (@rustyio)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="stylesheet.css" rel="stylesheet" type="text/css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Getting Started with Nitrogen</h1>

<p><a href="http://nitrogenproject.com">Home</a> | <b>Getting Started</b> | <a href="./api.html">API</a> | <a href="./elements.html">Elements</a> | <a href="./actions.html">Actions</a> | <a href="./validators.html">Validators</a> | <a href="./handlers.html">Handlers</a> | <a href="./config.html">Configuration Options</a> | <a href="./advanced.html">Advanced Guides</a> | <a href="./troubleshooting.html">Troubleshooting</a> | <a href="./about.html">About</a>
</p>


<div class=headline>Getting Started</div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Common Questions</a></li>
<li><a href="#sec-2">2 Is there a Nitrogen Tutorial?</a></li>
<li><a href="#sec-3">3 How do I create a new Nitrogen application?</a></li>
<li><a href="#sec-4">4 How do I add Nitrogen into an existing Erlang application?</a></li>
<li><a href="#sec-5">5 How do I start/stop/manage Nitrogen?</a></li>
<li><a href="#sec-6">6 How do I change configuration settings?</a></li>
<li><a href="#sec-7">7 Where is the code for my website?</a></li>
<li><a href="#sec-8">8 How do I compile my code?</a></li>
<li><a href="#sec-9">9 How do I create new pages, custom elements, or custom actions?</a></li>
<li><a href="#sec-10">10 How do I make a mobile version?</a></li>
<li><a href="#sec-11">11 How do I work with Nitrogen Plugins?</a></li>
<li><a href="#sec-12">12 How do I upgrade to a new version of Nitrogen?</a></li>
<li><a href="#sec-13">13 What do I do if I run into errors? How do I troubleshoot?</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Common Questions</h2>
<div class="outline-text-2" id="text-1">


<ul>
<li><a href="#sec-2">Is there a Nitrogen Tutorial?</a>
</li>
<li><a href="#sec-3">How do I create a new Nitrogen application?</a>
</li>
<li><a href="#sec-4">How do I add Nitrogen to an existing Erlang application?</a>
</li>
<li><a href="#sec-5">How do I start and stop my application?</a>
</li>
<li><a href="#sec-6">How do I change configuration settings?</a>
</li>
<li><a href="#sec-7">Where is the code for my website?</a>
</li>
<li><a href="#sec-8">How do I compile my code?</a>
</li>
<li><a href="#sec-9">How do I create new pages, custom elements, or custom actions?</a>
</li>
<li><a href="#sec-10">How do I make a mobile version?</a>
</li>
<li><a href="#sec-11">How do I work with Nitrogen Plugins?</a>
</li>
<li><a href="#sec-12">How do I upgrade to a new version of Nitrogen?</a>
</li>
<li><a href="#sec-13">What do I do if I run into errors? How do I troubleshoot?</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><a name="0" id="0"></a><span class="section-number-2">2</span> Is there a Nitrogen Tutorial?</h2>
<div class="outline-text-2" id="text-2">


<p>
  Yes! You can <a href="./tutorial.html">view the updated slides</a> from Rusty's Nitrogen Tutorial at the
  Erlang User Conference 2010 here.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><a name="100" id="100"></a><span class="section-number-2">3</span> How do I create a new Nitrogen application?</h2>
<div class="outline-text-2" id="text-3">


<p>
  Note: If you want to add Nitrogen to an existing application, see <a href="#sec-4">this question</a>
</p>
<p>
  First, check the <a href="http://nitrogenproject.com/downloads">Downloads</a> page to
  see if a pre-built package exists for your OS/architecture. If it does, then
  just download the package, unzip, and you are ready to start coding. (You
  don't even need to have Erlang installed, the Nitrogen binaries come with it
  pre-packaged.)
</p>
<p>
  If you don't see a package that will run on your computer, or you want to try
  running from the latest code in source control, then follow the steps below:
</p>
<p>
  Pull the latest source code from GitHub:
</p>
<pre class="example">
git clone https://github.com/nitrogen/nitrogen
</pre>


<p>
  Then run:
</p>
<pre class="example">
make rel_inets
</pre>


<p>
  This creates a completely self-contained starter application under
  <code>../myapp</code> that runs on Inets, Erlang's built in HTTP server.
  "Self-contained" here means that the <code>../myapp</code> directory contains
  everything you need to develop and run nitrogen, including the Erlang VM. To
  create a <code>.tar.gz</code> version of this code, exactly like you would find on the
  <a href="http://nitrogenproject.com/downloads">Downloads</a> page, run:
</p>
<pre class="example">
make package_inets
</pre>


<p>
  You can also run Nitrogen with Mochiweb, Yaws, Cowboy, or Webmachine. Run one
  of the following make commands:
</p>
<pre class="example">
make rel_cowboy
make rel_mochiweb
make rel_webmachine
make rel_yaws
</pre>


<p>
  <b>FreeBSD</b>: Compiling on FreeBSD requires using <code>gmake</code> instead of <code>make</code>,
  otherwise the steps are the same
</p>
<p>
  <b>Microsoft Windows</b>: There are special instructions for Windows users who
  wish to compile on Windows. Read about
  <a href="https://github.com/nitrogen/nitrogen/blob/master/rel/overlay/win/README.md">Compiling Nitrogen on Windows</a>
</p>
<p> 
  There are also "slim release" versions that can be built. These take
  advantage of a new feature introduced in Erlang's R15B02 release, which
  packages up an application, but does not include a full Erlang distribution
  (instead, it assumes the target system has Erlang installed already).
</p>
<p>
  You can create these "slim releases" by typing:
</p>
<pre class="example">
make slim_cowboy
make slim_inets
make slim_mochiweb
make slim_webmachine
make slim_yaws
</pre>


<p>
  All of the above commands can be provided with PREFIX or PROJECT variables to
  change the destination of the project, and the project directory name and
  node name. Note: it does not currently change the actual name of the Erlang
  application (the Application will still be called "nitrogen").
</p>
<p>
  For example:
</p>
<pre class="example">
make slim_yaws PROJECT=my_awesome_yaws_app PREFIX=~/my_web_apps
</pre>


<p>
  Will create a <code>my_web_apps/my_awesome_yaws_app</code> directory in your home
  directory.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><a name="200" id="200"></a><span class="section-number-2">4</span> How do I add Nitrogen into an existing Erlang application?</h2>
<div class="outline-text-2" id="text-4">


<p>
  As of 2.2.0, adding Nitrogen to an existing Erlang application is simple.
</p>
<p>
  Clone Nitrogen somewhere on your machine:
</p>
<pre class="example">
git clone git://github.com/nitrogen/nitrogen.git
</pre>


<p>
  Then, from the root of your application's directory, run the <code>embed</code> script
  from the Nitrogen repo:
</p>
<pre class="example">
/path/to/nitrogen/embed
</pre>


<p>
  <i>Note: You must run this from your *application's* directory, *not* from the   Nitrogen directory.</i>
</p>
<p>
  <i>Note 2: This assumes your system has Perl installed</i>
</p>
<p>
  You can read the full writeup in
  <a href="http://sigma-star.com/blog/post/embedding-nitrogen">in this blog post</a>.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><a name="300" id="300"></a><span class="section-number-2">5</span> How do I start/stop/manage Nitrogen?</h2>
<div class="outline-text-2" id="text-5">


<p>
  To start Nitrogen in the console
</p>
<pre class="example">
bin/nitrogen console
</pre>


<p>
  To start Nitrogen, type
</p>
<pre class="example">
bin/nitrogen start
</pre>


<p>
  To attach to a detached Nitrogen console
</p>
<pre class="example">
bin/nitrogen attach
</pre>


<p>
  To stop Nitrogen
</p>
<pre class="example">
bin/nitrogen stop
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><a name="400" id="400"></a><span class="section-number-2">6</span> How do I change configuration settings?</h2>
<div class="outline-text-2" id="text-6">


<p>
  Read all about the <a href="./config.html">configuration options</a>.
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><a name="500" id="500"></a><span class="section-number-2">7</span> Where is the code for my website?</h2>
<div class="outline-text-2" id="text-7">


<p>
  Your entire site's code can be found in <code>site/</code>.
</p>
<p>
  Within there, you'll find:
</p>
<dl>
<dt><code>site/src</code></dt><dd>Your erlang code

</dd>
<dt><code>site/static</code></dt><dd>Where static resources like CSS, Javascript, and Images Go

</dd>
<dt><code>site/templates</code></dt><dd>Where your site's HTML templates go

</dd>
<dt><code>site/ebin</code></dt><dd>Where the compiled BEAM files go.
</dd>
</dl>


<p>
  <b>If you're using a full release</b>, it's recommended to put the <code>site/</code> directory under source control.
</p>
<p>
  <b>If you're using a slim release</b>, you can put the entire application under source control.
</p>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><a name="600" id="600"></a><span class="section-number-2">8</span> How do I compile my code?</h2>
<div class="outline-text-2" id="text-8">


<p>
  There are three different ways to compile code in Nitrogen:
</p>
<ul>
<li>If you are <b>in the Erlang console</b> then run <code>sync:go().</code>

<p>
    This will start the <code>sync</code> process, which scans the filesystem
    for changes and automatically recompiles modules as they are changed.
</p>
<p>
    <b>Note:</b> sync will only recompile files that are changed <i>after</i> sync was
    started. That means that if sync is not currently running, and you change a
    file, it will not detect that change.
</p>
</li>
<li>If <b>Nitrogen is running in the background</b> then run <code>./bin/dev     compile</code>

<p>
    This connects to the running Nitrogen application and issues a
    <code>sync:go().</code> command.
</p>
</li>
<li>If <b>Nitrogen is stopped</b> then run <code>make</code>

<p>
    This calls <code>./rebar get-deps</code> to retrieve dependencies,
    <code>./do-plugins.escript</code> to process any plugins, and finally
    <code>./rebar compile</code>.
</p></li>
</ul>


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><a name="700" id="700"></a><span class="section-number-2">9</span> How do I create new pages, custom elements, or custom actions?</h2>
<div class="outline-text-2" id="text-9">


<p>
  Nitrogen 2.0+ includes a developer tool to help you get started with a
  bare-bones page, element, or action. This tool uses the files found in
  <code>./site/.prototypes</code> as templates. If you wish, you can edit files in this
  directory to make them more suitable for your application.
</p>
<ul>
<li>To create a new page at <a href="http://localhost/user/login">http://localhost/user/login</a>, run:

<pre class="example">
./bin/dev page user_login
</pre>


</li>
<li>To create a new element called <code>#custom_element{}</code>, run:

<pre class="example">
./bin/dev element custom_element
</pre>


</li>
<li>To create a new action called <code>#custom_action{}</code>, run:

<pre class="example">
./bin/dev action custom_action
</pre>

</li>
</ul>


<p>
  The code is placed under <code>./site/src</code>, <code>./site/src/elements</code>, or
  <code>./site/src/actions</code> for pages, elements, and actions,
  respectively. 
</p>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><a name="800" id="800"></a><span class="section-number-2">10</span> How do I make a mobile version?</h2>
<div class="outline-text-2" id="text-10">


<p>
  You can read all about how to make mobile-enabled sites with Nitrogen by
  reading our
  <a href="http://nitrogenproject.com/doc/jquery_mobile_integration.html">Mobile Integration Guide</a>
</p>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><a name="900" id="900"></a><span class="section-number-2">11</span> How do I work with Nitrogen Plugins?</h2>
<div class="outline-text-2" id="text-11">


<p>
  Adding Plugins to a Nitrogen app is as simple as adding them as rebar dependencies.
</p>



<pre class="src src-erlang">{my_plugin, {git, <span class="org-string">"git://github.com/some_user/my_plugin.git"</span>, {branch, master}}}
</pre>


<p>
  Then running:
</p>
<pre class="example">
make
</pre>


<p>
  You can read more detail about the Nitrogen plugin system its own section
  here <a href="./plugins.html">in the documentation</a>.
</p>
<p>
  You can also play with creating your own Nitrogen plugins by checking out and
  modifying our
  <a href="https://github.com/nitrogen/sample_nitrogen_plugin">Sample Nitrogen Plugin</a>
</p>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><a name="1000" id="1000"></a><span class="section-number-2">12</span> How do I upgrade to a new version of Nitrogen?</h2>
<div class="outline-text-2" id="text-12">


<p>
  <b>Upgrading to 2.3</b>
</p>
<p>    
    Following the instructions for upgrading to 2.2.2 will work except that
  websockets won't be available. For a more complete upgrade guide, see the
  <a href="./upgrade2.3.html">See the 2.3 upgrading guide</a>
</p>
<p>
  <b>Upgrading from 2.1 to any version up to 2.2.2</b>
</p>
<p>
    Edit your rebar.config file and make sure dependencies are pointing at the
    desired tag (ex: <code>{tag, "v2.2.2"}</code>) then run:
</p>
<pre class="example">
make upgrade
</pre>


<p>
    This will upgrade to the latest version of Nitrogen and it's dependencies.
    It will <b>not</b> upgrade to the latest Erlang Runtime System. If you wish to
    upgrade your version of ERTS, You'll want to follow the directions below for
    upgrading from pre-2.1 to 2.1+.
</p>
<p>
    <b>Note:</b> If you've run <code>make upgrade</code> and nothing seems to have worked,
    please check out the relevant question in the
    <a href="./troubleshooting.html">Troubleshooting</a> guide.
</p>
<p>
  <b>If you're running a version of Nitrogen pre 2.1 and want to upgrade to 2.1.0 and above:</b>
</p>
<ul>
<li>Build or download the new Nitrogen environment for your architecture and
    preferred web server. Unzip to a new directory.

</li>
<li>Copy your existing <code>./etc</code> directory to the new build. This retains your
    configuration settings.

</li>
<li>Copy your existing <code>./site</code> directory to the new build, <b>except</b> for the
    files in <code>./site/static/nitrogen</code>. You will want to use the new version of
    any files in <code>./site/static/nitrogen</code>.

<p>
    This will update the Erlang version, the dependencies files, and
    all of the Javascript used by Nitrogen. 
</p>
<p>    
    You will also need to update your code if there are any API level changes.
</p></li>
</ul>


</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><a name="1100" id="1100"></a><span class="section-number-2">13</span> What do I do if I run into errors? How do I troubleshoot?</h2>
<div class="outline-text-2" id="text-13">


<p>
  See our <a href="./troubleshooting.html">Troubleshooting Guide</a>
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-11-12 19:50:35 CST</p>
<p class="author">Author: Rusty Klophaus (@rustyio)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/index.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
